package oop;

//메소드(Method) : 클래스 내부에 선언된 함수 - 멤버함수
// => 필드(멤버변수)를 이용하여 필요한 기능을 제공하기 위한 명령의 모임
// => 명령(Statement)은 메소드 내부에서만 작성 가능

//함수(Function) : 매개변수로 값을 제공받아 계산하여 결과를 반환하는 명령의 모임 - 기능

//메소드 선언하는 방법
//형식) 반환형 메소드명(자료형 변수명, 자료형 변수명, ...) {
//     		명령;//메소드를 호출하면 실행되는 명령
//          ...
//      } 
//반환형(ReturnType) : 메소드를 호출하여 얻을 수 있는 결과값에 대한 자료형
// => void 자료형(무반환형) : 메소드를 호출하여 얻을 수 있는 결과값이 없는 경우 사용하는 자료형 
//메소드의 () 기호에는 변수를 나열하여 선언 - 매개변수(Parameter - Argument)
// => 메소드에 작성된 명령을 실행하기 위해 필요한 값을 메소드 호출시 전달받아 저장하기 위한 변수
// => 메소드에 작성된 명령을 실행하기 위한 값이 필요없는 경우 매개변수 생략 가능

//메소드 호출(Method Invoke) : 메소드에 작성된 명령들을 실행하여 필요한 기능 제공
//형식) 객체.메소드명(값, 값, ...)
// => 객체가 저장된 참조변수를 사용하여 객체의 메소드 호출
// => 메소드 호출시 매개변수에 차례대로 값을 전달하여 메소드 호출
// => 매개변수에 값이 정상적으로 전달되지 않으면 메소드 호출 불가능 - 에러 발생

//return 키워드 : 메소드를 강제로 종료하기 위한 키워드
//형식-1) if(조건식) return;  
// => 메소드의 반환형을 [void]로 작성
//형식-2) return 반환값;
// => 메소드를 종료하면서 반환값(변수 또는 연산식)을 메소드를 호출하는 명령에게 제공
// => 메소드의 반환형을 대상의 자료형과 반드시 같도록 작성

//객체 생성(참조)이 목적인 클래스 - main 메소드 미작성
public class Method {
	
}











